package 데이터타입;

public class 데이터의타입 {
    public static void main(String[] args) {

    /*
    * 정수형 *
    데이터 타입 / 메모리의 크기 / 표현 가능 범위
    byte  / 1 byte / -128 ~ 127
    short / 2 byte / -32,768 ~ 32767
    int   / 4 byte / -2147483648 ~ 2,147,483,647
    long  / 8 byte / -9223,372,036,854,775,808 ~ 9,223,372,036,854,775,807
     */

        byte a;
//    a = 128; // a는 byte기 때문에 128이라는 데이터를 담을 수 없음 (표현 가능 범위 초과)
//    a = 127; // 사용 가능



    /*
    * 실수형 *
    데이터 타입 / 메모리의 크기 / 표현 가능 범위
    float  / 4 byte / +-(1.40129846432481707e-45 ~ 340282346638528860e+38)
    double / 8 byte / +-(4.94065645841246544e-324d ~ 1.79769313486231570e+308d)
    (주로 double 사용)
     */



    /*
    * 문자 *
    데이터 타입 / 메모리의 크기 / 표현 가능 범위
    char / 2 byte / 모든 유니코드 문자
     */



    }
}
